{
    "<|begin_of_text|>": 0,
    "<|eot_id|>": 1,
    "<|start_header_id|>": 2,
    "<|end_header_id|>": 3,
    "<|end_of_text|>": 4,
    "<|UNK|>": 5,
    "!_E": 6,
    "!_M": 7,
    "$_M": 8,
    "&_B": 9,
    "'_B": 10,
    "'_E": 11,
    "'_M": 12,
    "'_S": 13,
    ",_E": 14,
    ",_M": 15,
    "-_B": 16,
    "-_E": 17,
    "-_M": 18,
    "._E": 19,
    "._M": 20,
    "3_S": 21,
    ":_E": 22,
    ":_M": 23,
    ":_S": 24,
    ";_E": 25,
    ";_M": 26,
    "?_E": 27,
    "?_M": 28,
    "A_B": 29,
    "A_E": 30,
    "A_M": 31,
    "A_S": 32,
    "B_B": 33,
    "B_M": 34,
    "C_B": 35,
    "C_M": 36,
    "D_B": 37,
    "D_E": 38,
    "D_M": 39,
    "E_B": 40,
    "E_E": 41,
    "E_M": 42,
    "F_B": 43,
    "F_E": 44,
    "F_M": 45,
    "G_B": 46,
    "G_E": 47,
    "G_M": 48,
    "G_S": 49,
    "H_B": 50,
    "H_M": 51,
    "I_B": 52,
    "I_E": 53,
    "I_M": 54,
    "I_S": 55,
    "J_B": 56,
    "J_M": 57,
    "K_B": 58,
    "K_M": 59,
    "L_B": 60,
    "L_E": 61,
    "L_M": 62,
    "M_B": 63,
    "M_M": 64,
    "N_B": 65,
    "N_E": 66,
    "N_M": 67,
    "O_B": 68,
    "O_E": 69,
    "O_M": 70,
    "O_S": 71,
    "P_B": 72,
    "P_E": 73,
    "P_M": 74,
    "Q_B": 75,
    "R_B": 76,
    "R_E": 77,
    "R_M": 78,
    "R_S": 79,
    "S_B": 80,
    "S_E": 81,
    "S_M": 82,
    "T_B": 83,
    "T_M": 84,
    "U_B": 85,
    "U_M": 86,
    "V_B": 87,
    "V_M": 88,
    "W_B": 89,
    "W_M": 90,
    "X_B": 91,
    "X_M": 92,
    "Y_B": 93,
    "Y_E": 94,
    "Y_M": 95,
    "Z_M": 96,
    "a_B": 97,
    "a_E": 98,
    "a_M": 99,
    "a_S": 100,
    "b_B": 101,
    "b_E": 102,
    "b_M": 103,
    "c_B": 104,
    "c_E": 105,
    "c_M": 106,
    "d_B": 107,
    "d_E": 108,
    "d_M": 109,
    "e_B": 110,
    "e_E": 111,
    "e_M": 112,
    "f_B": 113,
    "f_E": 114,
    "f_M": 115,
    "g_B": 116,
    "g_E": 117,
    "g_M": 118,
    "h_B": 119,
    "h_E": 120,
    "h_M": 121,
    "i_B": 122,
    "i_E": 123,
    "i_M": 124,
    "j_B": 125,
    "j_M": 126,
    "k_B": 127,
    "k_E": 128,
    "k_M": 129,
    "l_B": 130,
    "l_E": 131,
    "l_M": 132,
    "m_B": 133,
    "m_E": 134,
    "m_M": 135,
    "n_B": 136,
    "n_E": 137,
    "n_M": 138,
    "o_B": 139,
    "o_E": 140,
    "o_M": 141,
    "p_B": 142,
    "p_E": 143,
    "p_M": 144,
    "q_B": 145,
    "q_M": 146,
    "r_B": 147,
    "r_E": 148,
    "r_M": 149,
    "s_B": 150,
    "s_E": 151,
    "s_M": 152,
    "t_B": 153,
    "t_E": 154,
    "t_M": 155,
    "u_B": 156,
    "u_E": 157,
    "u_M": 158,
    "v_B": 159,
    "v_M": 160,
    "w_B": 161,
    "w_E": 162,
    "w_M": 163,
    "x_E": 164,
    "x_M": 165,
    "y_B": 166,
    "y_E": 167,
    "y_M": 168,
    "z_B": 169,
    "z_E": 170,
    "z_M": 171
}